import React, {PureComponent} from "react";

class Agreement extends PureComponent {

    render() {
        return (
            <div className="app-container">
                <div className="column content my-2 px-1">
                    <h2 className="has-text-centered">Политика в отношении обработки персональных данных</h2>
                    <p>Настоящая политика обработки персональных данных определяет порядок обработки персональных
                        данных и меры по обеспечению безопасности персональных данных depa.io (далее – Оператор).
                        Оператор ставит своей важнейшей целью и условием осуществления своей деятельности соблюдение
                        прав и свобод человека и гражданина при обработке его персональных данных, в том числе защиты
                        прав на неприкосновенность частной жизни, личную и семейную тайну. Настоящая политика Оператора
                        в отношении обработки персональных данных (далее – Политика) применяется ко всей информации,
                        которую Оператор может получить о посетителях <a href="https://depa.io"> depa.io</a> (далее - Сайт).</p>
                    <h4 className="has-text-centered">1. Основные понятия, используемые в Политике</h4>
                    <p>1.1. Автоматизированная обработка персональных данных – обработка персональных данных с помощью
                        средств вычислительной техники.</p>
                    <p>1.2. Блокирование персональных данных - временное прекращение обработки персональных данных
                        (за исключением случаев, если обработка необходима для уточнения персональных данных).</p>
                    <p>1.3. Информационная система персональных данных - совокупность содержащихся в базах данных
                        персональных данных, и обеспечивающих их обработку информационных технологий и технических
                        средств.</p>
                    <p>1.4. Обезличивание персональных данных - действия, в результате которых невозможно определить
                        без использования дополнительной информации принадлежность персональных данных конкретному
                        Пользователю или иному субъекту персональных данных.</p>
                    <p>1.5. Обработка персональных данных - любое действие или совокупность действий, совершаемых с
                        использованием средств автоматизации или без использования таких средств с персональными
                        данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение, извлечение,
                        использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование,
                        удаление, уничтожение персональных данных.</p>
                    <p>1.6. Оператор - государственный орган, муниципальный орган, юридическое или физическое лицо,
                        самостоятельно или совместно с другими лицами организующие и (или) осуществляющие обработку
                        персональных данных, а также определяющие цели обработки персональных данных, состав
                        персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными
                        данными.</p>
                    <p>1.7. Пользователь - любой посетитель Сайта.</p>
                    <p>1.8. Предоставление персональных данных - действия, направленные на раскрытие персональных данных
                        определенному лицу или определенному кругу лиц.</p>
                    <p>1.9. Распространение персональных данных - любые действия, направленные на раскрытие персональных
                        данных неопределенному кругу лиц (передача персональных данных) или на ознакомление с
                        персональными данными неограниченного круга лиц, в том числе обнародование персональных данных
                        в средствах массовой информации, размещение в информационно-телекоммуникационных сетях или
                        предоставление доступа к персональным данным каким-либо иным способом.</p>
                    <p>1.10. Трансграничная передача персональных данных - передача персональных данных на территорию
                        иностранного государства органу власти иностранного государства, иностранному физическому
                        или иностранному юридическому лицу.</p>
                    <p>1.11. Уничтожение персональных данных - любые действия, в результате которых персональные данные
                        уничтожаются безвозвратно с невозможностью дальнейшего восстановления содержания персональных
                        данных в информационной системе персональных данных и (или) результате которых уничтожаются
                        материальные носители персональных данных.</p>

                    <h4 className="has-text-centered">2. Цели обработки персональных данных</h4>
                    <p>2.1. Цель обработки персональных данных Пользователя - информирование Пользователя посредством
                        отправки электронных писем; предоставление доступа Пользователю к сервисам, информации и/или
                        материалам, содержащимся на Сайте.</p>
                    <p>2.2. Обезличенные данные Пользователей, собираемые с помощью сервисов статистики, служат для
                        сбора информации о действиях Пользователей на сайте, улучшения качества сайта и его содержания.</p>
                    <h4 className="has-text-centered">3. Правовые основания обработки персональных данных</h4>
                    <p>3.1. Оператор обрабатывает персональные данные Пользователя только в случае их заполнения и/или
                        отправки Пользователем самостоятельно через специальные формы, расположенные на Сайте. Заполняя
                        соответствующие формы и/или отправляя свои персональные данные Оператору, Пользователь выражает
                        свое согласие с данной Политикой.</p>
                    <p>3.2. Оператор обрабатывает обезличенные данные о Пользователе в случае, если это разрешено в
                        настройках браузера Пользователя.</p>
                    <h4 className="has-text-centered">4. Порядок сбора, хранения, передачи и обработки персональных данных</h4>
                    <p>Безопасность персональных данных, которые обрабатываются Оператором, обеспечивается путем реализации
                        правовых, организационных и технических мер, необходимых для выполнения в полном объеме требований
                        действующего законодательства в области защиты персональных данных.</p>
                    <p>4.1. Оператор обеспечивает сохранность персональных данных и принимает все возможные меры, исключающие
                        доступ к персональным данным неуполномоченных лиц.</p>
                    <p>4.2. Срок обработки персональных данных является неограниченным. Пользователь может в любой момент
                        отозвать свое согласие на обработку персональных данных, направив Оператору уведомление посредством
                        электронной почты на электронный адрес Оператора support@depa.io с пометкой «Отзыв согласия на
                        обработку персональных данных».</p>
                    <h4 className="has-text-centered">5. Заключительные положения</h4>
                    <p>Безопасность персональных данных, которые обрабатываются Оператором, обеспечивается путем реализации
                        правовых, организационных и технических мер, необходимых для выполнения в полном объеме требований
                        действующего законодательства в области защиты персональных данных.</p>
                    <p>5.1. Пользователь может получить любые разъяснения по интересующим вопросам, касающимся обработки его
                        персональных данных, обратившись к Оператору.</p>
                    <p>5.2. В данном документе будут отражены любые изменения политики обработки персональных данных
                        Оператором. Политика действует бессрочно до замены ее новой версией.</p>
                    <p>5.3. Актуальная версия Политики в свободном доступе расположена в сети Интернет по адресу
                        <a href="https://depa.io/user/policy"> depa.io</a>.</p>
                </div>
            </div>
        )
    }
}

export default Agreement